
const trailer_base = [
    {
    id: 1,
      image: "img/trailer-img1.png",
        name: "Not A Hero. Геймплейный трейлер",
    description: "Жанр: Action, Pixel",
    long_text:"Resident Evil 7: Not a Hero Геймплейный трейлер в хорошем качестве(HD 720 и 1080).Новые видео по игре Resident Evil 7: Not a Hero, а также последние новости, анонсы, скриншоты, обзоры, отзывы и другие материалы.Resident Evil 7: Not a Hero Геймплейный трейлер – смотрите онлайн и обсуждайте на Канобу!",
      // <iframe width="1040" height="585" src="https://www.youtube.com/embed/nNTZLygUUzc" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
     url:"https://www.youtube.com/embed/nNTZLygUUzc",
         genre: "popular",
    category: "trailer_horror",
    },
    {
        id: 2,
        image: "img/trailer-img2.png",
        name: "The Order: 1886 - Новый трейлер",
      description: "Жанр: Action",
      long_text:
        // <iframe width="635" height="364" src="https://www.youtube.com/embed/ia1zvRp7U24" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "Праздничным настроение этого ролика назвать нельзя, да и вообще сложно представить, чтобы мрачный неовикторианский Лондон, в котором происходят события The Order: 1886, мог выглядеть как-то иначе. Обитатели этого безрадостного мира уже много веков ведут ожесточённую борьбу с полукровками (half-breeds) — зооморфными существами, стремящимися захватить планету. Поэтому в трейлере снова предлагается смотреть на то, как бойцы Ордена расправляются с ликанами и враждебно настроенными по отношению к организации людьми. А чтобы усилить драматизм, авторы решили сыграть на контрасте видеоряда с музыкальным сопровождением, в качестве которого выступает гимн «Тихая ночь», созданный в 1818 году.",
      genre: "new",
         url:"https://www.youtube.com/embed/ia1zvRp7U24",
    category: "trailer_fantasy",
    },
    {
        id: 3,
       image: "img/trailer-img3.png",
        name: "FRed Dead Redemption: Золото Сэта",
      description: "Жанр: Action",
        long_text: "Америка, 1899 год. Наступил конец эпохи Дикого Запада. После того, как в западном городе Блэкуотер произошло ограбление, Артур Морган и банда Ван дер Линде вынуждены бежать. С федеральными агентами и лучшими охотниками за головами, собирающимися по пятам, банда должна грабить, воровать и пробиваться через суровый центр Америки, чтобы выжить. Поскольку углубляющиеся внутренние разногласия угрожают разлучить банду, Артур должен сделать выбор между собственными идеалами и лояльностью к банде, которая его воспитала.",
      genre: "popular",
         url:"https://youtu.be/LJKtKcHly2o",
    category: "trailer_action",
    },
    {
        id: 4,
        image: "img/trailer-img4.png",
        name: "FineSweeper. Демонстрация игрового процесса",
      description: "Жанр: Action, Pixel",
      long_text:
        // <iframe width="617" height="400" src="https://www.youtube.com/embed/nQKL9BoCJ2E" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "Встречайте качественное короткометражное кино Золото Сета по мотивам RDR с Джоном Марстоном в главных ролях, снятое студией Zapruder Picture.Джон Марстон вернулся к своим поклонникам. Пусть и не в образе главного героя новой части полюбившейся нам Red Dead Redemption, а как герой короткометражного фильма по мотивам игры. Но от этого он не стал менее крутым, а даже наоборот.Фильм снят в Альмерии, Испания, там же, где снимались сотни классических спагетти-вестернов несколько десятилетий назад. Представители Zapruder Picture заявили, что не просили разрешения о Rockstar на съемку фильма, однако надеются, что никаких недоразумений не возникнет. Кроме того, компания Zapruder никак не связана с Rockstar, а фильм снят исключительно потому, что они являются фанатами игры и хотели подарить приятные впечатления другим.",
      genre: "new",
         url:"https://www.youtube.com/embed/nQKL9BoCJ2E",
    category: "trailer_horror",
  },
    {
        id: 5,
        image: "img/trailer-img5.png",
        name: "Видеодайджест от AM4 Выпуск/211",
      description: "Жанр: Action, Pixel",
      long_text:
        // <iframe width="720" height="405" src="https://www.youtube.com/embed/7RCgT-XOPr4" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "АМ4 (PGA или µOPGA 1331) — разъём процессора (сокет) для микропроцессоров от компании AMD с микроархитектурой Zen (бренд Ryzen) и последующих; представлен в 2016 году. Разъём относится к типу PGA (pin grid array) и имеет 1331 контакт.Он стал первым сокетом от AMD для материнских плат с поддержкой стандарта памяти DDR4 и единым разъёмом как для высокопроизводительных процессоров без интегрированного видеоядра (по аналогии с Socket AM3+), так и для недорогих процессоров и APU (ранее использовали различные сокеты серий AM / FM). Продукты AMD планируется реализовывать на АМ4, вместо ранее предполагавшегося сокета FM3.",
      genre: "popular",
         url:"https://www.youtube.com/embed/7RCgT-XOPr4",
    category: "trailer_fantasy",
  },
    {
        id: 6,
        image: "img/trailer-img6.png",
        name: "Топ 10 лучший сюжет в играх",
      description: "Жанр: Action",
      long_text:
        // <iframe width="720" height="405" src="https://www.youtube.com/embed/b0mZvpFUq6s" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "Хороший сюжет нужен не каждой игре. Например, в файтинги и строительные симуляторы мы играем точно не ради сюжета. С другой стороны, интересная и грамотно поданная история будет большим плюсом для RTS или шутера. А в приключенческих играх и визуальных новеллах сюжет зачастую важнее игровых механик.Интересно, что до понятия «сюжет» игровая индустрия дошла не сразу. Первая компьютерная игра («OXO») появилась в 1952 году, но первая компьютерная игра с сюжетом («Star Trek») выпущена лишь в 1971-м. Потом уже появилось сразу несколько текстовых квестов на основе системы DnD и, что называется, понеслась.Революция случилась в 1980-м, когда Роберта и Кен Уильямс (будущие основатели «Sierra On-Line») выпустили первую графическую сюжетную игру – «Mystery House». Тогда стало понятно, что компьютерные игры вот-вот перестанут быть просто развлечением. Игроки начали ассоциировать себя с персонажами. Они захотели «проживать» эти истории, а не просто двигаться из пункта А в пункт Б.С тех пор минуло 40 лет, игрострой шагнул так далеко, что многие игры стали опасно похожи на реальность. Сегодня мы рассмотрим лучшие из них. Игры с действительно интересным сюжетом, «переживательными» героями и атмосферным, запоминающимся миром.",
      genre: "new",
         url:"https://www.youtube.com/embed/b0mZvpFUq6s",
    category: "trailer_action",
  },
    {
        id: 7,
        image: "./img/trailer-img7.jpg",
        name: "Серия BioShock",
      description: "Жанр: Action, Pixel",
      long_text:
        // <iframe width="786" height="360" src="https://www.youtube.com/embed/iRYfxDw72kA" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "Несмотря на разные названия контор, всю трилогию выпускали одни и те же ребята. Причем первые две игры связаны сюжетом, третью сразу позиционировали как «духовного наследника». И все три действительно удались! Во многом благодаря тому, что во всех трех сюжет – не просто фон, а определяющий фактор, основа мотивации героя и игрока. В жанровом плане серия – шутер от первого лица с элементами RPG, а местами даже веет хоррором...Действие первых двух игр разворачивается в 1960-е годы. Герой в результате авиакатастрофы случайно попадает в подводный город «Восторг», построенный миллионером Эндрю Райаном, который хотел создать на дне океана идеальное общество. Некоторое время у Райана все получалось. Но потом, как это часто бывает, что-то пошло не так… Вторая игра, как уже было сказано, сюжетно продолжает первую, но герой другой (без спойлеров, но это был гениальный ход!). Третья полностью сохраняет стилистику и манеру двух первых, но переносит нас в 1912-й на просторы летающего города «Колумбия». И вроде бы связи между «Колумбией» и «Восторгом нет… Но это пока не пройдешь DLC.",
      genre: "popular",
         url:"https://www.youtube.com/embed/iRYfxDw72kA",
    category: "trailer_horror",
    
  },
    {
        id: 8,
        image: "./img/trailer-img8.jpg",
        name: "Max Payne",
      description: "Жанр: Action, Pixel",
      long_text:
        // <iframe width="786" height="360" src="https://www.youtube.com/embed/QSEjwszuEpw" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "На данный момент франшиза включает три игры, но сюжет второй и особенно третьей сильно уступает первой. Причем если с третьей все ясно – ее делали Rockstar Games, то у второй тот же разработчик, что и у первой. Жанрово все части – шутер от третьего лица. Фишкой с точки зрения механики стала возможность замедления времени (эффект «bullet time»), которая в дальнейшем успешно копировалась в десятках других проектов.Сюжет игры рассказывает историю детектива Макса Пейна (который получил внешность от сценариста и геймдизайнера Сэма Лейка). Пейн был «обычным копом», счастливым семьянином и просто хорошим парнем. Пока в какой-то момент банда обколотых наркоманов не ворвалась к нему в дом и не убила его близких. Дальше в стиле классики американского нуара Пейн начинает играть не по правилам, но сюжет тут совсем нетривиальный и действительно завораживает, заставляет сопереживать. Игра настолько «зашла», что в 2008 году по ней сняли одноименный фильм с Марком Уолбергом и Милой Кунис. И слава богу, снимал не Уве Болл! Так что кино достойное.",
      genre: "new",
         url:"https://www.youtube.com/embed/QSEjwszuEpw",
    category: "trailer_fantasy",
    },
    {
        id: 9,
        image: "./img/trailer-img9.jpg",
        name: "Silent Hill 2",
      description: "Жанр: Action, Pixel",
      long_text:
        // <iframe width="786" height="360" src="https://www.youtube.com/embed/DJ2ypjrT0jE" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "В серии 8 основных игр и 7 ответвлений, плюс два фильма по мотивам и комикс. Но вторую часть олдфаги признают лучшей, без вариантов. Была надежда на девятую, которую делали Кодзима и Дель’Торо, но ее отменили. Жанрово вторая часть сочетает в себе все, что только можно – приключение, экшн, выживание, хоррор и даже психологический хоррор (да, есть и такой). В 2012 году вышел ремастер, но только на PS3 и Xbox 360.Игра начинается с того, что главный герой получает письмо от жены, которая приглашает его в некий городок Сайлент Хилл в штате Мичиган. Все бы ничего, да только жена умерла три года назад. Но это героя не смущает, и он отправляется в туманный Сайлент Хилл, где, как говорит один из ключевых персонажей, «что-то не так». Дальше сюжет заводит героя в дебри самоанализа, предлагая по итогу 6 кардинально различных концовок, пути к которым совершенно неочевидны. С единственным DLC «Born from a Wish» (название-то говорящее…) история начинает играть принципиально новыми красками.",
      genre: "popular",
         url:"https://www.youtube.com/embed/DJ2ypjrT0jE",
    category: "trailer_action",
  },
    {
        id: 10,
        image: "./img/trailer-img10.jpg",
        name: "Kingdom Come: Deliverance",
      description: "Жанр: Action, Pixel",
      long_text:
        // <iframe width="786" height="360" src="https://www.youtube.com/embed/pyuntVuW1L0" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "Игру выпустили чехи и она про чехов, только про средневековых. Действие происходит в Богемии 1403 года на фоне конфликта короля Вацлава IV и его брата Сигизмунда. Уникальность игры в том, что это действительно первая игра, где вооружение, доспехи, архитектура и остальные элементы мира реконструированы, а не выдуманы. То есть это реально исторический боевик, а не фэнтезийный.Главный герой – Индржик, сын кузнеца из Скалицы. Основной сюжет начинается с разграбления деревни наемными половцами из армии Сигизмунда. Герой, естественно, теряет семью и всех близких, но… геройствовать не спешит. Потому что игра все-таки ближе к реальности, чем к эпическому фэнтези. И сын кузнеца, при всем уважении, не ровня в бою профессиональному наемнику, и даже бандиту, который живет убийствами. Так что путь свой Индржик начинает с самых низов, буквально – с народного ополчения. Вот чем этот путь закончится… В общем, не зря в год выхода игра победила на Gamescom в номинации «Best PC Game».",
      genre: "new",
         url:"https://www.youtube.com/embed/pyuntVuW1L0",
    category: "trailer_horror",
  },
    {
        id: 11,
        image: "./img/trailer-img11.jpg",
        name: "Celeste",
      description: "Жанр: Action, Pixel",
      long_text:
      //  <iframe width="700" height="360" src="https://www.youtube.com/embed/70d9irlxiB4" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "Для автора этих строк хардкорный платформер с пиксельной графикой Celeste стал главным открытием 2018 года. Когда я запускал эту внешне несуразную игру, то ожидал получить всего лишь череду сложнейших препятствий, но Celeste многократно превзошла мои самые смелые ожидания. Под пеленой невзрачного платформера скрывается знакомая многим людям история про попытки найти самого себя, найти тот самый смысл жизни, преодолевая многочисленные преграды на своем пути.Как лучше всего понять чего ты стоишь? Ответ прост: вырваться из зоны комфорта и пойти на встречу к своей мечте через череду сложнейших испытаний и именно об этом повествует сюжет Celeste. Редко какому художественному произведению удается в финале заставить задуматься о собственной жизни и пересмотреть взгляды на привычные вещи, но у Celeste без проблем получается провернуть этот трюк с геймером. И, как видно, я не одинок в этом мнении, ведь платформер заслужил прекрасные отзывы среди критиков и занимает второе место среди самых высокооцененных игр 2018 года. ",
      genre: "popular",
         url:"https://www.youtube.com/embed/70d9irlxiB4",
    category: "trailer_fantasy",
    },
    {
        id: 12,
        image: "./img/trailer-img12.jpg",
        name: "Hellblade: Senua’s Sacrifice",
      description: "Жанр: Action, Pixel",
      long_text:
        // <iframe width="786" height="360" src="https://www.youtube.com/embed/2SM-ZzaBHGU" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "С самого начала ребята из Ninja Theory говорили, что проект инди, то есть бюджет будет минимальный. Поэтому геймеры закономерно не ждали шедевра. Но в итоге история кельтской воительницы Сенуа привлекла внимание прессы на уровне игры AAA-класса. Виной тому не игровые механики (они типичны) и не красивые локации (они интересны, но не поражают воображение). Причина в сюжете и атмосфере, у которых реально нет аналогов.Главная героиня, потеряв мужа, сходит с ума. А проблема в том, что она – воин, вот прям профессиональный. Поэтому девушка не может просто смириться с потерей и отправляется в Хель, чтобы вернуть душу возлюбленного. С собой она берет его забальзамированную голову, которая нужна для ритуала воскрешения. Завязка кажется чистым безумием? Да, и это только начало! Сюжет Hellblade: Senua’s Sacrifice заходит значительно глубже, чем типичные игры жанров «темное фэнтези» и «психологический хоррор». Игрок раз за разом теряет связь с реальностью, переставая понимать – где настоящий мир, а где лишь грезы Сенуа. Но и это лишь поверхностный пласт истории…",
      genre: "new",
         url:"https://www.youtube.com/embed/2SM-ZzaBHGU",
    category: "trailer_action",
  },
    {
        id: 13,
        image: "./img/trailer-img13.jpg",
        name: "The Path",
      description: "Жанр: Action, Pixel",
      long_text:
        // <iframe width="786" height="360" src="https://www.youtube.com/embed/99RDO_v6tPQ" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "В год выпуска проекта «Игромания» дала ему звание «Анти-игра года». Но не потому что The Path не удался. Он удался, но получилось нечто большее, чем компьютерная игра. Даже жанр невозможно определить – тут и хоррор, и психологизм, и симулятор ходьбы. Как сказали сами разработчики, «мы лишь создаем ситуацию, а ее сюжетный потенциал – это игровой процесс и воображение игрока». И правда, без воображения этот опус даже не стоит запускать.Фабула проста и знакома каждому – это история Красной Шапочки. Тут есть героиня, точнее – шесть героинь, и каждая – Красная Шапочка, одна из ее версий. Тут есть тропинка к домику бабушки, Темный Лес и Серый Волк. Но история происходит в нашем времени. Главный нюанс с точки зрения сюжета – эту игру невозможно пройти, победа в ней невозможна. Игрок лишь может выбрать вариант поражения, но даже гибель героинь здесь не ведет к завершению сюжета. Потому что каждый их шаг, каждый их вздох – это символ. Задача игрока – расшифровать эти символы. Ну, хотя бы попытаться…",
      genre: "popular",
         url:"https://www.youtube.com/embed/99RDO_v6tPQ",
    category: "trailer_horror",
  },
    {
        id: 14,
        image: "./img/trailer-img14.jpg",
        name: "Horizon Zero Dawn",
      description: "Жанр: Action, Pixel",
      long_text:
        // <iframe width="786" height="360" src="https://www.youtube.com/embed/9KrYRov2YZw" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "Учитывая, что нидерландская контора Guerrilla Games до этого своего шедевра была известна лишь серией неплохих шутеров Killzone для PS, к проекту изначально не было доверия. Уж слишком амбициозным он казался. Но 10 миллионов проданных копий за 2 года заставили разработчика адаптировать игру под ПК, а потом и сиквел анонсировать, запланировав выпуск на 2021 год.Horizon Zero Dawn представляет собой экшн-РПГ с открытым миром в сеттинге постапокалипсиса. В Золотой Век технологий что-то произошло, люди деградировали до костяных копий и первобытнообщинного строя, а по земле бродят динозавры. Огромные механические динозавры с продвинутым ИИ в своих исполинских головах. Играть нам предстоит за девочку по имени Элой, которую воспитывает племенной изгнанник Раст. В детстве Элой находит «Визор», артефакт прошлого, который оказывается устройством дополненной реальности. Дальше девушка взрослеет под бдительным управлением игрока и раскрывает историю таинственного мира, где Аполлон, Аид и Гея – это вовсе не имена древнегреческих богов.",
      genre: "new",
         url:"https://www.youtube.com/embed/9KrYRov2YZw",
    category: "trailer_fantasy",
  },
    {
        id: 15,
        image: "./img/trailer-img15.jpg",
        name: "Disco Elysium",
      description: "Жанр: Action, Pixel",
      long_text:
        // <iframe width="786" height="360" src="https://www.youtube.com/embed/it-in5rCJoA" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "Эта история уже стала легендой – как инди-проект никому не известной эстонской конторы неожиданно получил награду «Игра года 2019», покорив миллионы сердец настолько нетривиальным сюжетом и настолько уникальной атмосферой, что ее даже не с чем сравнить. Игра обрела бешеную популярность, так что меньше чем через полгода ее выпустили под Mac, а в 2021-м адаптируют под PS4 и Xbox One.Жанрово игра представляет собой РПГ с открытым миром и интерфейсом типа «point and click». Главный герой – полицейский-алкоголик, расследующий дело об убийстве в вымышленном городе Ревашоль. Город когда-то был центром коммунистической революции, но его слава давно померкла. Как и слава нашего героя, который, внезапно выйдя из очередного запоя, забыл вообще все – кто он, где он, зачем он. Это игроку и предстоит выяснить, а попутно – все-таки попытаться расследовать убийство, за которым, естественно, кроется нечто большее, чем нищета и хаотичная преступность, давно ставшие в Ревашоле нормой.",
      genre: "popular",
         url:"https://www.youtube.com/embed/it-in5rCJoA",
    category: "trailer_action",
  },
    {
        id: 16,
        image: "./img/trailer-img16.jpg",
        name: "Мор (Утопия)",
      description: "Жанр: Action, Pixel",
      long_text:
        // <iframe width="786" height="360" src="https://www.youtube.com/embed/q32eSxn0O10" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "За пределами СНГ игру знают как Pathologic. Ее выпустила российская компания, также известная без преувеличения легендарным шедевром «Тургор» (и его упрощенной версией «Тургор: Голос Цвета»). «Мор» представляет собой нетипичную смесь приключения, РПГ и экшна, которую разработчики определили как «симулятор поведения человека в условиях эпидемии, ориентированный на механизм принятия правильных решений». И с этим сложно поспорить, потому что в сюжете «Мора» решения определяют все – от глобальной реакции мира до доступных игровых механик. Место действия – безымянный город на краю пустошей, охваченный эпидемией смертельной инфекции. В игре три главных персонажа – бакалавр медицинских наук, гаруспик (читай – некромант, но без мистики) и девушка, потерявшая память. Игрок проходит истории героев последовательно, они развиваются параллельно, но напрямую не пересекаются. Каждый персонаж преследует собственные цели, причем они не обязательно совпадают с целями игрока, а порой – намеренно отличаются. Тут и приходится выбирать, причем выбор в игре всегда между плохим и очень плохим вариантом. Что касается переиздания 2019 года, то… лучше бы его не было.",
      genre: "new",
         url:"https://www.youtube.com/embed/q32eSxn0O10",
    category: "trailer_horror",
    },
    {
        id: 17,
        image: "./img/trailer-img17.jpg",
        name: "The Last of Us",
      description: "Жанр: Action, Pixel",
      long_text:
        // <iframe width="700" height="360" src="https://www.youtube.com/embed/W01L70IGBgE" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "Когда сценарист и креативный директор игры Нил Дракман приступил к разработке The Last of Us, он поставил себе цель «поднять уровень сюжета в играх на новый уровень». В некоторой мере у него это удалось и игра получила в 2013 году ряд премий за лучший сценарий. В тоже время, хоть мы и не считаем сюжет The Last of Us лучшим в истории игровой индустрии, он точно заслуживает пристального внимания и вполне способен достучаться до сердец даже черствых геймеров.История Джоэла и Элли, путешествующих через всю Америку ради благой миссии, заставляет породниться игрока с этой, внешне кажущейся, несовместимой парочкой. Как и God of War, игра умело играет на родительских чувствах. Но опуская любые сантименты, ценность The Last of Us в том, что это крайне жестокая игра, обнажающая всю темную сущность людей. Даже главный герой здесь не из отряда добрых ребят и не раз удивит игроков своими п(р)оступками.",
      genre: "popular",
         url:"https://www.youtube.com/embed/W01L70IGBgE",
    category: "trailer_fantasy",
    },
    {
        id: 18,
        image: "./img/trailer-img18.jpg",
        name: "FineSweeper. Демонстрация игрового процесса",
      description: "Жанр: Action, Pixel",
      long_text:
        // <iframe width="700" height="360" src="https://www.youtube.com/embed/GQVMu9bl_X0" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
        "Эта игра отличный антипод The Last of Us, показывающий, что рассказать волнительную и трогающую за душу историю можно без дорогих катсцен и передовой графики. Valiant Hearts The Great War выглядит крайне простенько, непритязательно, но благодаря сюжету нашла огромную армию поклонников среди геймеров всех возрастов.По сюжету игры переплетается судьбы четырех главных героев, которые против своей воли были втянуты в кровавую Первую мировую войну. На фоне трагических событий игрок увидит историю полную отважных героев, обладающих доблестными сердцами(Valiant Hearts) и готовых на все ради спасения своих родных и возможности дать потомкам возможность жить в лучшем мире. Истории об общечеловеческих ценностях всегда будут оставаться актуальными и игра Valiant Hearts The Great War – лучший тому пример.",
      genre: "new",
         url:"https://www.youtube.com/embed/GQVMu9bl_X0",
    category: "trailer_action",
    },
];
export const getTrailerObject = array => {
    return array.reduce((obj,item) =>({
        ...obj,
        [item.id]:item
    }),{})
}

export default trailer_base;
